projectFiles/straightPipe/Re20000/q-500/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1200;
        startFace       2860;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       4060;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       4080;
    }
    heatWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          240;
        startFace       4100;
    }
)

// ************************************************************************* //
